
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>微服务 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="../设计模式/" />
    
    
    <link rel="prev" href="../网络/" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    概述
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../数据结构与算法/">
            
                <a href="../数据结构与算法/">
            
                    
                    数据结构与算法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../java/">
            
                <a href="../java/">
            
                    
                    Java
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../java/base/">
            
                <a href="../java/base/">
            
                    
                    基础
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="../java/collection/">
            
                <a href="../java/collection/">
            
                    
                    容器
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.2.1" data-path="../java/collection/list.html">
            
                <a href="../java/collection/list.html">
            
                    
                    List
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2.2" data-path="../java/collection/hashmap.html">
            
                <a href="../java/collection/hashmap.html">
            
                    
                    HashMap
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="../java/multithread/">
            
                <a href="../java/multithread/">
            
                    
                    multithread
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="../java/jvm/">
            
                <a href="../java/jvm/">
            
                    
                    jvm
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.4.1" data-path="../java/jvm/gc.html">
            
                <a href="../java/jvm/gc.html">
            
                    
                    GC
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4.2" data-path="../java/base/classloader.md">
            
                <span>
            
                    
                    类加载器
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3.5" data-path="../java/io/">
            
                <a href="../java/io/">
            
                    
                    io
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.6" data-path="../java/java8/">
            
                <a href="../java/java8/">
            
                    
                    java8特性
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../spring/">
            
                <a href="../spring/">
            
                    
                    spring
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="../spring/spring.html">
            
                <a href="../spring/spring.html">
            
                    
                    spring
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="../spring/springmvc.html">
            
                <a href="../spring/springmvc.html">
            
                    
                    springmvc
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="../spring/springboot.html">
            
                <a href="../spring/springboot.html">
            
                    
                    springboot
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.4" data-path="../spring/springcloud.html">
            
                <a href="../spring/springcloud.html">
            
                    
                    springcloud
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="../mysql/">
            
                <a href="../mysql/">
            
                    
                    Mysql
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="../redis/">
            
                <a href="../redis/">
            
                    
                    Redis
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.6.1" data-path="../redis/base.html">
            
                <a href="../redis/base.html">
            
                    
                    基础
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="../网络/">
            
                <a href="../网络/">
            
                    
                    网络
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.8" data-path="./">
            
                <a href="./">
            
                    
                    微服务
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="../设计模式/">
            
                <a href="../设计模式/">
            
                    
                    设计模式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="../desgin/">
            
                <a href="../desgin/">
            
                    
                    设计题
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.10.1" data-path="../desgin/sharding.html">
            
                <a href="../desgin/sharding.html">
            
                    
                    分库分表
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10.2" data-path="../desgin/rpc.html">
            
                <a href="../desgin/rpc.html">
            
                    
                    RPC设计
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10.3" data-path="../desgin/数据一致性设计.md">
            
                <span>
            
                    
                    微服务数据一致性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10.4" data-path="../desgin/分布式锁实现.md">
            
                <span>
            
                    
                    分布式锁实现
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10.5" data-path="../desgin/分布式事物设计.md">
            
                <span>
            
                    
                    分布式事物设计
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10.6" data-path="../desgin/消息队列设计设计.md">
            
                <span>
            
                    
                    消息队列设计
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >微服务</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x5FAE;&#x670D;&#x52A1;">&#x5FAE;&#x670D;&#x52A1;</h1>
<h2 id="soa&#x4E0E;&#x5FAE;&#x670D;&#x52A1;&#x7684;&#x533A;&#x522B;&#xFF1F;">SOA&#x4E0E;&#x5FAE;&#x670D;&#x52A1;&#x7684;&#x533A;&#x522B;&#xFF1F;</h2>
<h3 id="soa">SOA</h3>
<p>SOA&#x7684;&#x63D0;&#x51FA;&#x662F;&#x5728;&#x4F01;&#x4E1A;&#x8BA1;&#x7B97;&#x9886;&#x57DF;&#xFF0C;&#x5C31;&#x662F;&#x8981;&#x5C06;&#x7D27;&#x8026;&#x5408;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x5212;&#x5206;&#x4E3A;&#x9762;&#x5411;&#x4E1A;&#x52A1;&#x7684;&#xFF0C;&#x7C97;&#x7C92;&#x5EA6;&#xFF0C;&#x677E;&#x8026;&#x5408;&#xFF0C;&#x65E0;&#x72B6;&#x6001;&#x7684;&#x670D;&#x52A1;&#x3002;&#x670D;&#x52A1;&#x53D1;&#x5E03;&#x51FA;&#x6765;&#x4F9B;&#x5176;&#x4ED6;&#x670D;&#x52A1;&#x8C03;&#x7528;&#xFF0C;&#x4E00;&#x7EC4;&#x4E92;&#x76F8;&#x4F9D;&#x8D56;&#x7684;&#x670D;&#x52A1;&#x5C31;&#x6784;&#x6210;&#x4E86;SOA&#x67B6;&#x6784;&#x4E0B;&#x7684;&#x7CFB;&#x7EDF;&#x3002;</p>
<p>&#x57FA;&#x4E8E;&#x8FD9;&#x4E9B;&#x57FA;&#x7840;&#x7684;&#x670D;&#x52A1;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x4E1A;&#x52A1;&#x8FC7;&#x7A0B;&#x7528;&#x7C7B;&#x4F3C;BPEL&#x6D41;&#x7A0B;&#x7684;&#x65B9;&#x5F0F;&#x7F16;&#x6392;&#x8D77;&#x6765;&#xFF0C;&#x800C;BPEL&#x53CD;&#x6620;&#x7684;&#x662F;&#x4E1A;&#x52A1;&#x5904;&#x7406;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x8FD9;&#x4E9B;&#x8FC7;&#x7A0B;&#x5BF9;&#x4E8E;&#x4E1A;&#x52A1;&#x4EBA;&#x5458;&#x66F4;&#x4E3A;&#x76F4;&#x89C2;&#xFF0C;&#x8C03;&#x6574;&#x4E5F;&#x6BD4;hardcode&#x7684;&#x4EE3;&#x7801;&#x66F4;&#x5BB9;&#x6613;&#x3002;</p>
<p>&#x5F53;&#x7136;&#x4F01;&#x4E1A;&#x8FD8;&#x9700;&#x8981;&#x5BF9;&#x670D;&#x52A1;&#x6CBB;&#x7406;&#xFF0C;&#x6BD4;&#x5982;&#x670D;&#x52A1;&#x6CE8;&#x518C;&#x5E93;&#xFF0C;&#x76D1;&#x63A7;&#x7BA1;&#x7406;&#x7B49;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x4F01;&#x4E1A;&#x8BA1;&#x7B97;&#x9886;&#x57DF;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x662F;&#x4EA4;&#x6613;&#x7CFB;&#x7EDF;&#x7684;&#x8BDD;&#xFF0C;&#x5E76;&#x53D1;&#x91CF;&#x90FD;&#x4E0D;&#x662F;&#x5F88;&#x5927;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E00;&#x53F0;&#x670D;&#x52A1;&#x5668;&#x5C31;&#x5BB9;&#x7EB3;&#x5C06;&#x8BB8;&#x8BB8;&#x591A;&#x591A;&#x7684;&#x670D;&#x52A1;&#xFF0C;&#x8FD9;&#x4E9B;&#x670D;&#x52A1;&#x91C7;&#x7528;&#x7EDF;&#x4E00;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#xFF0C;&#x53EF;&#x80FD;&#x90FD;&#x8FD0;&#x884C;&#x5728;&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x5668;&#x7684;&#x8FDB;&#x7A0B;&#x4E2D;&#x3002;&#x867D;&#x7136;&#x8BF4;&#x662F;&#x9762;&#x5411;&#x670D;&#x52A1;&#x4E86;&#xFF0C;&#x4F46;&#x8FD8;&#x662F;&#x5355;&#x4E00;&#x7684;&#x7CFB;&#x7EDF;&#x3002;</p>
<h3 id="&#x5FAE;&#x670D;&#x52A1;">&#x5FAE;&#x670D;&#x52A1;</h3>
<p>&#x800C;&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x5927;&#x4F53;&#x662F;&#x4ECE;&#x4E92;&#x8054;&#x7F51;&#x4F01;&#x4E1A;&#x5174;&#x8D77;&#x7684;&#xFF0C;&#x7531;&#x4E8E;&#x5927;&#x89C4;&#x6A21;&#x7528;&#x6237;&#xFF0C;&#x5BF9;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x7684;&#x8981;&#x6C42;&#x5F88;&#x9AD8;&#xFF0C;&#x5982;&#x679C;&#x50CF;&#x4F01;&#x4E1A;&#x8BA1;&#x7B97;&#x90A3;&#x6837;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x4F38;&#x7F29;&#x5C31;&#x9700;&#x8981;&#x591A;&#x4E2A;&#x5BB9;&#x7EB3;&#x7EED;&#x7EED;&#x591A;&#x591A;&#x7684;&#x670D;&#x52A1;&#x7684;&#x7CFB;&#x7EDF;&#x5B9E;&#x4F8B;&#xFF0C;&#x524D;&#x9762;&#x901A;&#x8FC7;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x4F7F;&#x5F97;&#x591A;&#x4E2A;&#x7CFB;&#x7EDF;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x96C6;&#x7FA4;&#x3002;</p>
<p>&#x4F46;&#x8FD9;&#x662F;&#x5F88;&#x4E0D;&#x65B9;&#x4FBF;&#x7684;&#xFF0C;&#x4E92;&#x8054;&#x7F51;&#x4F01;&#x4E1A;&#x8FED;&#x4EE3;&#x7684;&#x5468;&#x671F;&#x5F88;&#x77ED;&#xFF0C;&#x4E00;&#x5468;&#x53EF;&#x80FD;&#x53D1;&#x5E03;&#x4E00;&#x4E2A;&#x7248;&#x672C;&#xFF0C;&#x751A;&#x81F3;&#x53EF;&#x80FD;&#x6BCF;&#x5929;&#x4E00;&#x4E2A;&#x7248;&#x672C;&#xFF0C;&#x800C;&#x4E0D;&#x540C;&#x7684;&#x5B50;&#x7CFB;&#x7EDF;&#x7684;&#x53D1;&#x5E03;&#x5468;&#x671F;&#x662F;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#x3002;</p>
<p>&#x800C;&#x4E14;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x5B50;&#x7CFB;&#x7EDF;&#x4E5F;&#x4E0D;&#x50CF;&#x539F;&#x6765;&#x4F01;&#x4E1A;&#x8BA1;&#x7B97;&#x90A3;&#x6837;&#x91C7;&#x7528;&#x96C6;&#x4E2D;&#x5F0F;&#x7684;&#x5B58;&#x50A8;&#xFF0C;&#x4F7F;&#x7528;&#x6602;&#x8D35;&#x7684;Oracle&#x5B58;&#x50A8;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x4E8C;&#x662F;&#x4F7F;&#x7528;MongoDB&#xFF0C;HBase&#xFF0C;Cassandra&#x7B49;NOSQL&#x6570;&#x636E;&#x5E93;&#x548C;Redis&#xFF0C;memcache&#x7B49;&#x5206;&#x5E03;&#x5F0F;&#x7F13;&#x5B58;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x5C31;&#x503E;&#x5411;&#x91C7;&#x7528;&#x4EE5;&#x5B50;&#x7CFB;&#x7EDF;&#x4E3A;&#x5206;&#x5272;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x5B50;&#x7CFB;&#x7EDF;&#x91C7;&#x7528;&#x81EA;&#x5DF1;&#x7684;&#x67B6;&#x6784;&#xFF0C;&#x90A3;&#x4E48;&#x5404;&#x4E2A;&#x670D;&#x52A1;&#x8FD0;&#x884C;&#x81EA;&#x5DF1;&#x7684;Web&#x5BB9;&#x5668;&#x4E2D;&#xFF0C;&#x5F53;&#x9700;&#x8981;&#x589E;&#x52A0;&#x8BA1;&#x7B97;&#x80FD;&#x529B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x589E;&#x52A0;&#x8FD9;&#x4E2A;&#x5B50;&#x7CFB;&#x7EDF;&#x6216;&#x670D;&#x52A1;&#x7684;&#x5B9E;&#x4F8B;&#x5C31;&#x597D;&#x4E86;&#xFF0C;&#x5F53;&#x5347;&#x7EA7;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53EF;&#x4EE5;&#x4E0D;&#x5F71;&#x54CD;&#x522B;&#x7684;&#x5B50;&#x7CFB;&#x7EDF;&#x3002;&#x8FD9;&#x79CD;&#x7EC4;&#x7EC7;&#x65B9;&#x5F0F;&#x5927;&#x4F53;&#x4E0A;&#x5C31;&#x88AB;&#x79F0;&#x4F5C;&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x3002;</p>
<p>&#x5FAE;&#x670D;&#x52A1;&#x4E0E;SOA&#x76F8;&#x6BD4;&#xFF0C;&#x66F4;&#x5F3A;&#x8C03;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x7684;&#x7279;&#x6027;&#xFF0C;&#x6BD4;&#x5982;&#x6A2A;&#x5411;&#x4F38;&#x7F29;&#x6027;&#xFF0C;&#x670D;&#x52A1;&#x53D1;&#x73B0;&#xFF0C;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#xFF0C;&#x6545;&#x969C;&#x8F6C;&#x79FB;&#xFF0C;&#x9AD8;&#x53EF;&#x7528;&#x3002;&#x4E92;&#x8054;&#x7F51;&#x5F00;&#x53D1;&#x5BF9;&#x670D;&#x52A1;&#x6CBB;&#x7406;&#x63D0;&#x51FA;&#x4E86;&#x66F4;&#x591A;&#x7684;&#x8981;&#x6C42;&#xFF0C;&#x6BD4;&#x5982;&#x591A;&#x7248;&#x672C;&#xFF0C;&#x6BD4;&#x5982;&#x7070;&#x5EA6;&#x5347;&#x7EA7;&#xFF0C;&#x6BD4;&#x5982;&#x670D;&#x52A1;&#x964D;&#x7EA7;&#xFF0C;&#x6BD4;&#x5982;&#x5206;&#x5E03;&#x5F0F;&#x8DDF;&#x8E2A;&#xFF0C;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x5728;SOA&#x5B9E;&#x8DF5;&#x4E2D;&#x91CD;&#x89C6;&#x4E0D;&#x591F;&#x7684;&#x3002;</p>
<p>Docker&#x5BB9;&#x5668;&#x6280;&#x672F;&#x7684;&#x51FA;&#x73B0;&#xFF0C;&#x4E3A;&#x5FAE;&#x670D;&#x52A1;&#x63D0;&#x4F9B;&#x4E86;&#x66F4;&#x4FBF;&#x5229;&#x7684;&#x6761;&#x4EF6;&#xFF0C;&#x6BD4;&#x5982;&#x66F4;&#x5C0F;&#x7684;&#x90E8;&#x7F72;&#x5355;&#x5143;&#xFF0C;&#x6BCF;&#x4E2A;&#x670D;&#x52A1;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x7C7B;&#x4F3C;Node.js&#x6216;Spring Boot&#x7684;&#x6280;&#x672F;&#x8DD1;&#x5728;&#x81EA;&#x5DF1;&#x7684;&#x8FDB;&#x7A0B;&#x4E2D;&#x3002;&#x53EF;&#x80FD;&#x5728;&#x51E0;&#x5341;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#x4E2D;&#x8FD0;&#x884C;&#x6210;&#x5343;&#x4E0A;&#x4E07;&#x4E2A;Docker&#x5BB9;&#x5668;&#xFF0C;&#x6BCF;&#x4E2A;&#x5BB9;&#x5668;&#x90FD;&#x8FD0;&#x884C;&#x7740;&#x670D;&#x52A1;&#x7684;&#x4E00;&#x4E2A;&#x5B9E;&#x4F8B;&#x3002;&#x968F;&#x65F6;&#x53EF;&#x4EE5;&#x589E;&#x52A0;&#x67D0;&#x4E2A;&#x670D;&#x52A1;&#x7684;&#x5B9E;&#x4F8B;&#x6570;&#xFF0C;&#x6216;&#x8005;&#x67D0;&#x4E2A;&#x5B9E;&#x4F8B;&#x5D29;&#x6E83;&#x540E;&#xFF0C;&#x5728;&#x5176;&#x4ED6;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x4E0A;&#x518D;&#x521B;&#x5EFA;&#x8BE5;&#x670D;&#x52A1;&#x7684;&#x65B0;&#x7684;&#x5B9E;&#x4F8B;&#x3002;</p>
<h2 id="&#x5982;&#x4F55;&#x62C6;&#x5206;&#x670D;&#x52A1;&#xFF1F;">&#x5982;&#x4F55;&#x62C6;&#x5206;&#x670D;&#x52A1;&#xFF1F;</h2>
<p>&#x8981;&#x56F4;&#x7ED5;&#x4E1A;&#x52A1;&#x6A21;&#x5757;&#x8FDB;&#x884C;&#x62C6;&#x5206;&#xFF0C;&#x62C6;&#x5206;&#x7C92;&#x5EA6;&#x5E94;&#x8BE5;&#x4FDD;&#x8BC1;&#x5FAE;&#x670D;&#x52A1;&#x5177;&#x6709;&#x4E1A;&#x52A1;&#x7684;&#x72EC;&#x7ACB;&#x6027;&#x4E0E;&#x5B8C;&#x6574;&#x6027;&#xFF0C;&#x5C3D;&#x53EF;&#x80FD;&#x5C11;&#x7684;&#x5B58;&#x5728;&#x670D;&#x52A1;&#x4F9D;&#x8D56;&#xFF0C;&#x94FE;&#x5F0F;&#x8C03;&#x7528;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5728;&#x5B9E;&#x9645;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6709;&#x7684;&#x65F6;&#x5019;&#x5355;&#x4F53;&#x67B6;&#x6784;&#x66F4;&#x52A0;&#x9002;&#x5408;&#x5F53;&#x524D;&#x7684;&#x9879;&#x76EE;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x5FAE;&#x670D;&#x52A1;&#x7684;&#x8BBE;&#x8BA1;&#x5E76;&#x4E0D;&#x662F;&#x4E00;&#x8E74;&#x800C;&#x5C31;&#x7684;&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x8BBE;&#x8BA1;&#x4E0E;&#x53CD;&#x9988;&#x8FC7;&#x7A0B;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x8BBE;&#x8BA1;&#x4E4B;&#x521D;&#x53EF;&#x4EE5;&#x5C06;&#x670D;&#x52A1;&#x7684;&#x7C92;&#x5EA6;&#x8BBE;&#x8BA1;&#x7684;&#x5927;&#x4E00;&#x4E9B;&#xFF0C;&#x5E76;&#x8003;&#x8651;&#x5176;&#x53EF;&#x6269;&#x5C55;&#x6027;&#xFF0C;&#x968F;&#x7740;&#x4E1A;&#x52A1;&#x7684;&#x53D1;&#x5C55;&#xFF0C;&#x8FDB;&#x884C;&#x52A8;&#x6001;&#x5730;&#x62C6;&#x5206;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x4E0D;&#x9519;&#x7684;&#x9009;&#x62E9;&#x3002;</p>
<h2 id="&#x5FAE;&#x670D;&#x52A1;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x7406;&#x8BBA;">&#x5FAE;&#x670D;&#x52A1;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x7406;&#x8BBA;</h2>
<h3 id="cap&#x7406;&#x8BBA;">CAP&#x7406;&#x8BBA;</h3>
<p>&#x5728;&#x5206;&#x5E03;&#x5F0F;&#x6570;&#x636E;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x4E5F;&#x6709;&#x4E00;&#x4E2A;&#x5E3D;&#x5B50;&#x539F;&#x7406;(CAP Theorem)&#xFF0C;&#x4E0D;&#x8FC7;&#x6B64;&#x5E3D;&#x5B50;&#x975E;&#x5F7C;&#x5E3D;&#x5B50;&#x3002;CAP &#x539F;&#x7406;&#x4E2D;&#xFF0C;&#x6709;&#x4E09;&#x4E2A;&#x8981;&#x7D20;&#xFF1A;</p>
<ul>
<li>&#x4E00;&#x81F4;&#x6027;(C onsistency)</li>
<li>&#x53EF;&#x7528;&#x6027;(A vailability)</li>
<li>&#x5206;&#x533A;&#x5BB9;&#x5FCD;&#x6027;(P artition tolerance)</li>
</ul>
<p>CAP &#x539F;&#x7406;&#x6307;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x4E09;&#x4E2A;&#x8981;&#x7D20;&#x6700;&#x591A;&#x53EA;&#x80FD;&#x540C;&#x65F6;&#x5B9E;&#x73B0;&#x4E24;&#x70B9;&#xFF0C;&#x4E0D;&#x53EF;&#x80FD;&#x4E09;&#x8005;&#x517C;&#x987E;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#x5728;&#x8FDB;&#x884C;&#x5206;&#x5E03;&#x5F0F;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x65F6;&#xFF0C;&#x5FC5;&#x987B;&#x505A;&#x51FA;&#x53D6;&#x820D;&#x3002;&#x800C;&#x5BF9;&#x4E8E;&#x5206;&#x5E03;&#x5F0F;&#x6570;&#x636E;&#x7CFB;&#x7EDF;&#xFF0C;&#x5206;&#x533A;&#x5BB9;&#x5FCD;&#x6027;&#x662F;&#x57FA;&#x672C;&#x8981;&#x6C42; &#xFF0C;&#x5426;&#x5219;&#x5C31;&#x5931;&#x53BB;&#x4E86;&#x4EF7;&#x503C;&#xFF0C;&#x56E0;&#x6B64;&#x8BBE;&#x8BA1;&#x5206;&#x5E03;&#x5F0F;&#x6570;&#x636E;&#x7CFB;&#x7EDF;&#xFF0C;&#x5C31;&#x662F;&#x5728;&#x4E00;&#x81F4;&#x6027;&#x548C;&#x53EF;&#x7528;&#x6027;&#x4E4B;&#x95F4;&#x53D6;&#x4E00;&#x4E2A;&#x5E73;&#x8861;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x5927;&#x591A;&#x6570; WEB &#x5E94;&#x7528;&#xFF0C;&#x5176;&#x5B9E;&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x5F3A;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x56E0;&#x6B64;&#x727A;&#x7272;&#x4E00;&#x81F4;&#x6027;&#x800C;&#x6362;&#x53D6;&#x9AD8;&#x53EF;&#x7528;&#x6027;&#xFF0C;&#x662F;&#x76EE;&#x524D;&#x591A;&#x6570;&#x5206;&#x5E03;&#x5F0F;&#x6570;&#x636E;&#x5E93;&#x4EA7;&#x54C1;&#x7684;&#x65B9;&#x5411;&#x3002;&#x727A;&#x7272;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x53EA;&#x662F;&#x4E0D;&#x518D;&#x8981;&#x6C42;&#x5173;&#x7CFB;&#x578B;&#x6570; &#x636E;&#x5E93;&#x4E2D;&#x7684;&#x5F3A;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x800C;&#x662F;&#x53EA;&#x8981;&#x7CFB;&#x7EDF;&#x80FD;&#x8FBE;&#x5230;&#x6700;&#x7EC8;&#x4E00;&#x81F4;&#x6027;&#x5373;&#x53EF;&#xFF0C;&#x8003;&#x8651;&#x5230;&#x5BA2;&#x6237;&#x4F53;&#x9A8C;&#xFF0C;&#x8FD9;&#x4E2A;&#x6700;&#x7EC8;&#x4E00;&#x81F4;&#x7684;&#x65F6;&#x95F4;&#x7A97;&#x53E3;&#xFF0C;&#x8981;&#x5C3D;&#x53EF;&#x80FD;&#x7684;&#x5BF9;&#x7528;&#x6237;&#x900F;&#x660E;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x9700;&#x8981;&#x4FDD;&#x969C;&#x201C;&#x7528;&#x6237;&#x611F;&#x77E5;&#x5230;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x201D;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x591A;&#x6570;&#x5927;&#x578B;&#x4E92;&#x8054;&#x7F51;&#x5E94;&#x7528;&#x7684;&#x573A;&#x666F;&#xFF0C;&#x4E3B;&#x673A;&#x4F17;&#x591A;&#x3001;&#x90E8;&#x7F72;&#x5206;&#x6563;&#xFF0C;&#x800C;&#x4E14;&#x73B0;&#x5728;&#x7684;&#x96C6;&#x7FA4;&#x89C4;&#x6A21;&#x8D8A;&#x6765;&#x8D8A;&#x5927;&#xFF0C;&#x6240;&#x4EE5;&#x8282;&#x70B9;&#x6545;&#x969C;&#x3001;&#x7F51;&#x7EDC;&#x6545;&#x969C;&#x662F;&#x5E38;&#x6001;&#xFF0C;&#x800C;&#x4E14;&#x8981;&#x4FDD;&#x8BC1;&#x670D;&#x52A1;&#x53EF;&#x7528;&#x6027;&#x8FBE;&#x5230;N&#x4E2A;9&#xFF0C;&#x5373;&#x4FDD;&#x8BC1;P&#x548C;A&#xFF0C;&#x820D;&#x5F03;C&#xFF08;&#x9000;&#x800C;&#x6C42;&#x5176;&#x6B21;&#x4FDD;&#x8BC1;&#x6700;&#x7EC8;&#x4E00;&#x81F4;&#x6027;&#xFF09;&#x3002;&#x867D;&#x7136;&#x67D0;&#x4E9B;&#x5730;&#x65B9;&#x4F1A;&#x5F71;&#x54CD;&#x5BA2;&#x6237;&#x4F53;&#x9A8C;&#xFF0C;&#x4F46;&#x6CA1;&#x8FBE;&#x5230;&#x9020;&#x6210;&#x7528;&#x6237;&#x6D41;&#x7A0B;&#x7684;&#x4E25;&#x91CD;&#x7A0B;&#x5EA6;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x6D89;&#x53CA;&#x5230;&#x94B1;&#x8D22;&#x8FD9;&#x6837;&#x4E0D;&#x80FD;&#x6709;&#x4E00;&#x4E1D;&#x8BA9;&#x6B65;&#x7684;&#x573A;&#x666F;&#xFF0C;C&#x5FC5;&#x987B;&#x4FDD;&#x8BC1;&#x3002;&#x7F51;&#x7EDC;&#x53D1;&#x751F;&#x6545;&#x969C;&#x5B81;&#x53EF;&#x505C;&#x6B62;&#x670D;&#x52A1;&#xFF0C;&#x8FD9;&#x662F;&#x4FDD;&#x8BC1;CA&#xFF0C;&#x820D;&#x5F03;P&#x3002;&#x8C8C;&#x4F3C;&#x8FD9;&#x51E0;&#x5E74;&#x56FD;&#x5185;&#x94F6;&#x884C;&#x4E1A;&#x53D1;&#x751F;&#x4E86;&#x4E0D;&#x4E0B;10&#x8D77;&#x4E8B;&#x6545;&#xFF0C;&#x4F46;&#x5F71;&#x54CD;&#x9762;&#x4E0D;&#x5927;&#xFF0C;&#x62A5;&#x5230;&#x4E5F;&#x4E0D;&#x591A;&#xFF0C;&#x5E7F;&#x5927;&#x7FA4;&#x4F17;&#x77E5;&#x9053;&#x7684;&#x5C11;&#x3002;&#x8FD8;&#x6709;&#x4E00;&#x79CD;&#x662F;&#x4FDD;&#x8BC1;CP&#xFF0C;&#x820D;&#x5F03;A&#x3002;&#x4F8B;&#x5982;&#x7F51;&#x7EDC;&#x6545;&#x969C;&#x4E8B;&#x53EA;&#x8BFB;&#x4E0D;&#x5199;&#x3002;</p>
<h3 id="base&#x7406;&#x8BBA;">BASE&#x7406;&#x8BBA;</h3>
<ul>
<li><p>&#x57FA;&#x672C;&#x53EF;&#x7528;&#xFF08;Basically Available&#xFF09;</p>
<blockquote>
<p>&#x57FA;&#x672C;&#x53EF;&#x7528;&#x662F;&#x6307;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x5728;&#x51FA;&#x73B0;&#x6545;&#x969C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5141;&#x8BB8;&#x635F;&#x5931;&#x90E8;&#x5206;&#x53EF;&#x7528;&#x6027;&#xFF0C;&#x5373;&#x4FDD;&#x8BC1;&#x6838;&#x5FC3;&#x53EF;&#x7528;&#x3002;
&#x7535;&#x5546;&#x5927;&#x4FC3;&#x65F6;&#xFF0C;&#x4E3A;&#x4E86;&#x5E94;&#x5BF9;&#x8BBF;&#x95EE;&#x91CF;&#x6FC0;&#x589E;&#xFF0C;&#x90E8;&#x5206;&#x7528;&#x6237;&#x53EF;&#x80FD;&#x4F1A;&#x88AB;&#x5F15;&#x5BFC;&#x5230;&#x964D;&#x7EA7;&#x9875;&#x9762;&#xFF0C;&#x670D;&#x52A1;&#x5C42;&#x4E5F;&#x53EF;&#x80FD;&#x53EA;&#x63D0;&#x4F9B;&#x964D;&#x7EA7;&#x670D;&#x52A1;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x635F;&#x5931;&#x90E8;&#x5206;&#x53EF;&#x7528;&#x6027;&#x7684;&#x4F53;&#x73B0;&#x3002;</p>
</blockquote>
</li>
<li><p>&#x8F6F;&#x72B6;&#x6001;&#xFF08; Soft State&#xFF09;</p>
<blockquote>
<p>&#x8F6F;&#x72B6;&#x6001;&#x662F;&#x6307;&#x5141;&#x8BB8;&#x7CFB;&#x7EDF;&#x5B58;&#x5728;&#x4E2D;&#x95F4;&#x72B6;&#x6001;&#xFF0C;&#x800C;&#x8BE5;&#x4E2D;&#x95F4;&#x72B6;&#x6001;&#x4E0D;&#x4F1A;&#x5F71;&#x54CD;&#x7CFB;&#x7EDF;&#x6574;&#x4F53;&#x53EF;&#x7528;&#x6027;&#x3002;&#x5206;&#x5E03;&#x5F0F;&#x5B58;&#x50A8;&#x4E2D;&#x4E00;&#x822C;&#x4E00;&#x4EFD;&#x6570;&#x636E;&#x81F3;&#x5C11;&#x4F1A;&#x6709;&#x4E09;&#x4E2A;&#x526F;&#x672C;&#xFF0C;&#x5141;&#x8BB8;&#x4E0D;&#x540C;&#x8282;&#x70B9;&#x95F4;&#x526F;&#x672C;&#x540C;&#x6B65;&#x7684;&#x5EF6;&#x65F6;&#x5C31;&#x662F;&#x8F6F;&#x72B6;&#x6001;&#x7684;&#x4F53;&#x73B0;&#x3002;mysql replication&#x7684;&#x5F02;&#x6B65;&#x590D;&#x5236;&#x4E5F;&#x662F;&#x4E00;&#x79CD;&#x4F53;&#x73B0;&#x3002;</p>
</blockquote>
</li>
<li><p>&#x6700;&#x7EC8;&#x4E00;&#x81F4;&#x6027;&#xFF08; Eventual Consistency&#xFF09;</p>
<blockquote>
<p>&#x6700;&#x7EC8;&#x4E00;&#x81F4;&#x6027;&#x662F;&#x6307;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x6570;&#x636E;&#x526F;&#x672C;&#x7ECF;&#x8FC7;&#x4E00;&#x5B9A;&#x65F6;&#x95F4;&#x540E;&#xFF0C;&#x6700;&#x7EC8;&#x80FD;&#x591F;&#x8FBE;&#x5230;&#x4E00;&#x81F4;&#x7684;&#x72B6;&#x6001;&#x3002;&#x5F31;&#x4E00;&#x81F4;&#x6027;&#x548C;&#x5F3A;&#x4E00;&#x81F4;&#x6027;&#x76F8;&#x53CD;&#xFF0C;&#x6700;&#x7EC8;&#x4E00;&#x81F4;&#x6027;&#x662F;&#x5F31;&#x4E00;&#x81F4;&#x6027;&#x7684;&#x4E00;&#x79CD;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#x3002;</p>
</blockquote>
</li>
</ul>
<h2 id="springcloud&#x548C;dubbo&#x6709;&#x54EA;&#x4E9B;&#x533A;&#x522B;&#xFF1F;&#xFF1F;">SpringCloud&#x548C;Dubbo&#x6709;&#x54EA;&#x4E9B;&#x533A;&#x522B;&#xFF1F;&#xFF1F;</h2>
<p>&#x6700;&#x5927;&#x533A;&#x522B;&#xFF1A;SpringCloud&#x629B;&#x5F03;&#x4E86;Dubbo&#x7684;RPC&#x901A;&#x4FE1;&#xFF0C;&#x91C7;&#x7528;&#x7684;&#x662F;&#x57FA;&#x4E8E;HTTP&#x7684;REST&#x65B9;&#x5F0F;&#x3002;</p>
<p>&#x603B;&#x4F53;&#x6765;&#x8BF4;&#xFF0C;&#x4E24;&#x8005;&#x5404;&#x6709;&#x4F18;&#x52BF;&#x3002;&#x867D;&#x8BF4;&#x540E;&#x8005;&#x670D;&#x52A1;&#x8C03;&#x7528;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x4F46;&#x4E5F;&#x907F;&#x514D;&#x4E86;&#x4E0A;&#x9762;&#x63D0;&#x5230;&#x7684;&#x539F;&#x751F;RPC&#x5E26;&#x6765;&#x7684;&#x95EE;&#x9898;&#x3002;&#x800C;&#x4E14;REST&#x76F8;&#x6BD4;RPC&#x66F4;&#x4E3A;&#x7075;&#x6D3B;&#xFF0C;&#x670D;&#x52A1;&#x63D0;&#x4F9B;&#x65B9;&#x548C;&#x8C03;&#x7528;&#x65B9;&#x7684;&#x4F9D;&#x8D56;&#x53EA;&#x4F9D;&#x9760;&#x4E00;&#x7EB8;&#x5951;&#x7EA6;&#xFF0C;&#x4E0D;&#x5B58;&#x5728;&#x4EE3;&#x7801;&#x7EA7;&#x522B;&#x7684;&#x4F9D;&#x8D56;&#xFF0C;&#x8FD9;&#x5728;&#x5F3A;&#x8C03;&#x5FEB;&#x901F;&#x6F14;&#x5316;&#x7684;&#x5FAE;&#x670D;&#x52A1;&#x73AF;&#x5883;&#x4E0B;&#xFF0C;&#x663E;&#x5F97;&#x66F4;&#x52A0;&#x5408;&#x9002;&#x3002;</p>
<p>&#x54C1;&#x724C;&#x673A;&#x4E0E;&#x7EC4;&#x88C5;&#x673A;&#x7684;&#x533A;&#x522B;&#xFF1A;&#x5F88;&#x660E;&#x663E;SpringCloud&#x6BD4;dubbo&#x7684;&#x529F;&#x80FD;&#x66F4;&#x5F3A;&#x5927;&#xFF0C;&#x8986;&#x76D6;&#x9762;&#x66F4;&#x5E7F;&#xFF0C;&#x800C;&#x4E14;&#x80FD;&#x591F;&#x4E0E;SpringFramework&#x3001;SpringBoot&#x3001;SpringData&#x3001;SpringBatch&#x7B49;&#x5176;&#x4ED6;Spring&#x9879;&#x76EE;&#x5B8C;&#x7F8E;&#x878D;&#x5408;&#xFF0C;&#x8FD9;&#x4E9B;&#x5BF9;&#x4E8E;&#x5FAE;&#x670D;&#x52A1;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x3002;&#x4F7F;&#x7528;Dubbo&#x6784;&#x5EFA;&#x7684;&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x5C31;&#x50CF;&#x7EC4;&#x88C5;&#x7535;&#x8111;&#x3001;&#x5404;&#x73AF;&#x8282;&#x6211;&#x4EEC;&#x9009;&#x62E9;&#x81EA;&#x7531;&#x5EA6;&#x9AD8;&#xFF0C;&#x4F46;&#x662F;&#x6700;&#x603B;&#x53EF;&#x80FD;&#x4F1A;&#x56E0;&#x4E3A;&#x5185;&#x5B58;&#x8D28;&#x91CF;&#x800C;&#x5F71;&#x54CD;&#x6574;&#x4F53;&#xFF0C;&#x4F46;&#x5BF9;&#x4E8E;&#x9AD8;&#x624B;&#x8FD9;&#x4E5F;&#x5C31;&#x4E0D;&#x662F;&#x95EE;&#x9898;&#x3002;&#x800C;SpringCloud&#x5C31;&#x50CF;&#x54C1;&#x724C;&#x673A;&#xFF0C;&#x5728;Spring Source&#x7684;&#x6574;&#x5408;&#x4E0B;&#xFF0C;&#x505A;&#x4E86;&#x5927;&#x91CF;&#x7684;&#x517C;&#x5BB9;&#x6027;&#x6D4B;&#x8BD5;&#xFF0C;&#x4FDD;&#x8BC1;&#x4E86;&#x673A;&#x5668;&#x62E5;&#x6709;&#x66F4;&#x9AD8;&#x7684;&#x7A33;&#x5B9A;&#x6027;&#x3002;</p>
<p>&#x5728;&#x9762;&#x4E34;&#x5FAE;&#x670D;&#x52A1;&#x57FA;&#x7840;&#x6846;&#x67B6;&#x9009;&#x578B;&#x65F6;Dubbo&#x4E0E;SpringCloud&#x53EA;&#x80FD;&#x4E8C;&#x9009;&#x4E00;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../网络/" class="navigation navigation-prev " aria-label="Previous page: 网络">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="../设计模式/" class="navigation navigation-next " aria-label="Next page: 设计模式">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"微服务","level":"1.8","depth":1,"next":{"title":"设计模式","level":"1.9","depth":1,"path":"设计模式/README.md","ref":"设计模式/README.md","articles":[]},"previous":{"title":"网络","level":"1.7","depth":1,"path":"网络/README.md","ref":"网络/README.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"微服务/README.md","mtime":"2019-11-07T15:13:24.801Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-11-12T15:40:09.360Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

